load-tests/bluerpc-http.yml
config:
  target: "http://127.0.0.1:8889"
  phases:
    - duration: 10
      arrivalRate: 100
scenarios:
  - flow:
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "1"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "2"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "3"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "4"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "5"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "6"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "7"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "8"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "9"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "10"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "11"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "12"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "13"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "14"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "15"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "16"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "17"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "18"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "19"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "20"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "21"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "22"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "23"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "24"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "25"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "26"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "27"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "28"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "29"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "30"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "31"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "32"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "33"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "34"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "35"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "36"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "37"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "38"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "39"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "40"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "41"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "42"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "43"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "44"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "45"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "46"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "47"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "48"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "49"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "50"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "51"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "52"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "53"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "54"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "55"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "56"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "57"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "58"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "59"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "60"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "61"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "62"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "63"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "64"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "65"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "66"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "67"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "68"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "69"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "70"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "71"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "72"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "73"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "74"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "75"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "76"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "77"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "78"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "79"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "80"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "81"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "82"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "83"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "84"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "85"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "86"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "87"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "88"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "89"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "90"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "91"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "92"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "93"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "94"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "95"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "96"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "97"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "98"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "99"
    - post:
        url: "/"
        json:
          method: "echo"
          params:
            - "Hello"
          id: "100"